back-end/app/controllers/admins_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        current_admin = Admin.find(session[:admin_id])