back-end/app/controllers/sessions_controller.rb

    def create_admin
        admin = Admin.find_by(username: params[:username])
---
SELECT "admins".* FROM "admins" WHERE "admins"."username" = ? LIMIT ?  [["username", "CharlesDW"], ["LIMIT", 1]]